{
  "tools": "STRUMENTI",
  "title": "CARRIERA",
  "details": "Dettagli",
  "pienissimo": {
    "tasks": {
      "backend": {
        "title": "Ottimizzazione Backend & Performance",
        "description": "Refactoring e ottimizzazione di moduli esistenti per ridurre il carico sull’infrastruttura, mantenendo al contempo alta disponibilità e reattività."
      },
      "newApp": {
        "title": "Sviluppo della Nuova App per Ristoratori",
        "description": "Dopo aver reso stabile Pienissimo Pro (sviluppata in Swift), ho co-sviluppato la nuova applicazione di riferimento per i ristoratori utilizzando Flutter, gestendo in autonomia API e connessioni WebSocket."
      },
      "architecture": {
        "title": "Scalabilità & Decisioni Architetturali",
        "description": "Ho contribuito attivamente alle decisioni architetturali, guidando l’azienda attraverso sfide legate alla scalabilità e all’evoluzione dello stack tecnologico."
      },
      "devops": {
        "title": "DevOps & Best Practices",
        "description": "Supporto nella gestione delle pipeline CI/CD, nei processi di build e nelle revisioni del codice per mantenere alti standard di sviluppo all'interno del team."
      }
    },
    "sentences": {
      "first": "Pienissimo è attualmente l'azienda leader in Italia nel Direct Response Marketing per il settore della ristorazione, con migliaia di clienti attivi e un’infrastruttura IT in continua evoluzione.",
      "second": "In qualità di sviluppatore full-stack senior, ho svolto un ruolo chiave nell'ottimizzazione dei componenti critici, nel miglioramento delle prestazioni e nella garanzia della scalabilità, mantenendo sempre un forte focus sulle best practice, sull’architettura pulita e sulla manutenibilità a lungo termine."
    },
    "tools": {
      "other": {
        "list": "Typescript, Swift, AWS"
      },
      "backend": {
        "title": "Backend",
        "list": "Node.js, PostgreSQL, AWS, Socket.io"
      },
      "frontend-mobile": {
        "title": "Frontend e Mobile",
        "list": "Angular, Swift, Flutter"
      }
    }
  },
  "anubidigital": {
    "tasks": {
      "project": {
        "title": "Progettazione e realizzazione dell`architettura web",
        "description": "Ideazione dell'architettura web interna e per i clienti, inclusi backoffice e processi di onboarding"
      },
      "onboarding": {
        "title": "Onboarding",
        "description": "Sviluppo del processo di onboarding per i clienti, con particolare attenzione alla sicurezza e alla compliance"
      },
      "datawarehouse": {
        "title": "Datawarehouse",
        "description": "Realizzazione di un datawarehouse per la gestione di dati sensibili, secondo le normative vigenti nel settore"
      },
      "backoffice": {
        "title": "Backoffice",
        "description": "Sviluppo di un backoffice per la gestione dei clienti"
      },
      "rnd": {
        "title": "R&D",
        "description": "Partecipazione al team di ricerca e sviluppo, con focus su progetti su digital asset e fintech"
      }
    },
    "sentences": {
      "first": "Anubidigital è tra i pionieri italiani del settore web3. Nasce come custodia istituzionale di digital asset per poi specializzarsi nella produzione di software B2B per il settore fintech e digital asset.",
      "second": "In questa realtà ho avuto un ruolo fondamentale nello sviluppo iniziale dell'infrastruttura IT per la custodia, gestendo in autonomia molte aree di progetto. Una volta completato lo sviluppo della piattaforma mi sono unito al team di ricerca e sviluppo, fornendo il mio contributo da ingegnere del software alla realizzazione di idee e progetti che hanno successivamente portato l`azienda in un modello di business B2B."
    },
    "tools": {
      "other": {
        "list": "Typescript, Javascript, Jest, AWS, Gitlab, Jira"
      },
      "backend": {
        "title": "Backend",
        "list": "Node.js, PostgreSQL, MongoDB, Docker, Ether.js, Python, pandas"
      },
      "frontend": {
        "title": "Frontend",
        "list": "React, Next.js, TailwindCSS, Redux Toolkit"
      }
    }
  },
  "mobile": {
    "title": "Mobile Developer",
    "tasks": {
      "management": {
        "title": "Gestione",
        "description": "Gestione completa del ciclo di sviluppo di applicazioni mobili, inclusa l'interfaccia cliente e l'analisi dei requisiti"
      },
      "design": {
        "title": "Progettazione",
        "description": "Progettazione autonoma dell'architettura e delle interfacce delle app, applicando design patterns e aderendo a standard UX/UI e Material Design"
      },
      "integration": {
        "title": "Integrazione",
        "description": "Integrazione di funzionalità avanzate: mappature, pubblicità, supporto Firebase e persistenza dati"
      },
      "implementation": {
        "title": "Implementazione",
        "description": "Implementazione dell'accesso alle funzioni hardware dei dispositivi (fotocamera, bluetooth, giroscopio)"
      }
    },
    "sentences": {
      "first": "Come freelance mobile developer, ho orchestrato l'intero ciclo di vita delle applicazioni, dalla concezione alla consegna, garantendo soluzioni intuitive ed efficienti.",
      "second": "La gestione autonoma di ogni progetto mi ha permesso di affinare una comprensione olistica del processo di sviluppo, assicurando applicazioni che brillano per usabilità e soddisfazione dell'utente."
    },
    "tools": {
      "cross": {
        "list": "Flutter, Github, Jira, Firebase, Material Design, Design Patterns"
      },
      "android": {
        "title": "Android",
        "list": "Kotlin, Android Studio"
      },
      "ios": {
        "title": "iOS",
        "list": "Swift, Xcode"
      }
    }
  },
  "projects": {
    "employeeTag": "Impiegato",
    "anubidigital": {
      "description": "Anubidigital è tra i pionieri italiani del settore web3. Nasce come custodia istituzionale di digital asset per poi specializzarsi nel software B2B per il settore fintech."
    },
    "collectionmanager": {
      "description": "Un progetto personale che mi permette di tracciare i prezzi e analizzare i dati dei negozi della mia collezione di carte e altri oggetti da collezione."
    },
    "metch": {
      "description": "Il game changer! Metch è una piattaforma che mira a rendere il processo di ricerca di talenti e team nel settore gaming semplice ed efficiente."
    },
    "pienissimo": {
      "description": "Pienissimo è l'azienda leader in Italia nel Direct Response Marketing per il settore della ristorazione, con migliaia di clienti attivi."
    }
  }
}
