{
  "tools": "TOOLS",
  "pienissimo": {
    "tasks": {},
    "sentences": {
      "first": "",
      "second": ""
    },
    "tools": {
      "other": {
        "list": "Typescript, Swift, AWS"
      },
      "backend": {
        "title": "Backend",
        "list": "Node.js, PostgreSQL, AWS, Socket.io"
      },
      "frontend-mobile": {
        "title": "Frontend and Mobile",
        "list": "Angular, Swift, Flutter"
      }
    }
  },
  "anubidigital": {
    "tasks": {
      "project": {
        "title": "Design and implementation of the web architecture",
        "description": "Creation of the internal web architecture and for clients, including backoffice and onboarding processes"
      },
      "onboarding": {
        "title": "Onboarding",
        "description": "Development of the onboarding process for clients, with special attention to security and compliance"
      },
      "datawarehouse": {
        "title": "Data warehouse",
        "description": "Establishment of a data warehouse for the management of sensitive data, according to the regulations in the sector"
      },
      "backoffice": {
        "title": "Backoffice",
        "description": "Development of a backoffice for client management"
      },
      "rnd": {
        "title": "R&D",
        "description": "Participation in the research and development team, with a focus on projects on digital assets and fintech"
      }
    },
    "sentences": {
      "first": "Anubidigital is among the Italian pioneers of the web3 sector. It was born as an institutional custody of digital assets and then specialized in the production of B2B software for the fintech and digital asset sector.",
      "second": "In this company, I played a fundamental role in the initial development of the IT infrastructure for custody, independently managing many project areas. Once the platform development was completed, I joined the research and development team, providing my contribution as a software engineer to the realization of ideas and projects that subsequently led the company to a B2B business model."
    },
    "tools": {
      "other": {
        "list": "Typescript, Javascript, Jest, AWS, Gitlab, Jira"
      },
      "backend": {
        "title": "Backend",
        "list": "Node.js, PostgreSQL, MongoDB, Docker, Ether.js, Python, pandas"
      },
      "frontend": {
        "title": "Frontend",
        "list": "React, Next.js, TailwindCSS, Redux Toolkit"
      }
    }
  },

  "mobile": {
    "title": "Mobile Developer",
    "tasks": {
      "management": {
        "title": "Management",
        "description": "Complete management of the mobile application development cycle, including customer interface and requirement analysis"
      },
      "design": {
        "title": "Design",
        "description": "Independent design of the app architecture and interfaces, applying design patterns and adhering to UX/UI standards and Material Design"
      },
      "integration": {
        "title": "Integration",
        "description": "Integration of advanced features: mapping, advertising, Firebase support, and data persistence"
      },
      "implementation": {
        "title": "Implementation",
        "description": "Implementation of access to specific hardware functions of mobile devices (camera, bluetooth, gyroscope)"
      }
    },
    "sentences": {
      "first": "As a freelance mobile developer, I orchestrated the entire lifecycle of applications, from conception to delivery, ensuring intuitive and efficient solutions.",
      "second": "The autonomous management of each project allowed me to refine a holistic understanding of the development process, ensuring applications that shine for usability and user satisfaction."
    },
    "tools": {
      "cross": {
        "list": "Flutter, Github, Kira, Firebase, Material Design, Design Patterns"
      },
      "android": {
        "title": "Android",
        "list": "Kotlin, Android Studio"
      },
      "ios": {
        "title": "iOS",
        "list": "Swift, Xcode"
      }
    }
  }
}
