{
  "title": "CAREER",
  "tools": "TOOLS",
  "details": "Details",
  "pienissimo": {
    "tasks": {
      "backend": {
        "title": "Backend & Performance Optimization",
        "description": "Refactored and optimized existing modules to reduce infrastructure load while maintaining high availability and responsiveness."
      },
      "newApp": {
        "title": "New Restaurateur App Development",
        "description": "After stabilizing the Swift-based Pienissimo Pro, I co-developed the company's new flagship application for restaurateurs using Flutter, managing the APIs and WebSocket connections entirely independently."
      },
      "architecture": {
        "title": "Scalability & Architectural Decisions",
        "description": "Actively contributed to architectural discussions, guiding the company through key scalability challenges and technology stack evolution."
      },
      "devops": {
        "title": "DevOps & Best Practices",
        "description": "Supported CI/CD pipeline management, assisted in build processes, and conducted code reviews to uphold high development standards across the team."
      }
    },
    "sentences": {
      "first": "Pienissimo is currently the leading company in Italy for Direct Response Marketing in the restaurant industry, serving thousands of active clients with a rapidly evolving IT infrastructure.",
      "second": "As a senior full-stack developer, I have played a key role in optimizing critical components, improving performance, and ensuring scalability, all while maintaining a keen focus on best practices, clean architecture, and long-term maintainability."
    },
    "tools": {
      "other": {
        "list": "Typescript, Swift, AWS"
      },
      "backend": {
        "title": "Backend",
        "list": "Node.js, PostgreSQL, AWS, Socket.io"
      },
      "frontend-mobile": {
        "title": "Frontend and Mobile",
        "list": "Angular, Swift, Flutter"
      }
    }
  },
  "anubidigital": {
    "tasks": {
      "project": {
        "title": "Design and implementation of the web architecture",
        "description": "Creation of the internal web architecture and for clients, including backoffice and onboarding processes"
      },
      "onboarding": {
        "title": "Onboarding",
        "description": "Development of the onboarding process for clients, with special attention to security and compliance"
      },
      "datawarehouse": {
        "title": "Data warehouse",
        "description": "Establishment of a data warehouse for the management of sensitive data, according to the regulations in the sector"
      },
      "backoffice": {
        "title": "Backoffice",
        "description": "Development of a backoffice for client management"
      },
      "rnd": {
        "title": "R&D",
        "description": "Participation in the research and development team, with a focus on projects on digital assets and fintech"
      }
    },
    "sentences": {
      "first": "Anubidigital is among the Italian pioneers of the web3 sector. It was born as an institutional custody of digital assets and then specialized in the production of B2B software for the fintech and digital asset sector.",
      "second": "In this company, I played a fundamental role in the initial development of the IT infrastructure for custody, independently managing many project areas. Once the platform development was completed, I joined the research and development team, providing my contribution as a software engineer to the realization of ideas and projects that subsequently led the company to a B2B business model."
    },
    "tools": {
      "other": {
        "list": "Typescript, Javascript, Jest, AWS, Gitlab, Jira"
      },
      "backend": {
        "title": "Backend",
        "list": "Node.js, PostgreSQL, MongoDB, Docker, Ether.js, Python, pandas"
      },
      "frontend": {
        "title": "Frontend",
        "list": "React, Next.js, TailwindCSS, Redux Toolkit"
      }
    }
  },
  "projects": {
    "employeeTag": "Employee",
    "anubidigital": {
      "description": "Italian pioneers of the web3 sector. Born as an institutional custody of digital assets and then specialized in the production of B2B software for the fintech and digital asset sector."
    },
    "collectionmanager": {
      "description": "A personal project that allows me to track prices and analyze store data of my collection of cards and other collectibles."
    },
    "metch": {
      "description": "The game Changer! Match is a platform that aims to make the process of finding talents and teams in the gaming sector simple and efficient."
    },
    "pienissimo": {
      "description": "The leading company in Italy for Direct Response Marketing in the restaurant industry, serving thousands of active clients."
    }
  }
}
